Revit 2027 API
TemporaryViewModes.AcceleratedGraphicsMode Property
 The current state of the Accelerated Graphics mode in the associated view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AcceleratedGraphicsMode { get; set; }
Public Property AcceleratedGraphicsMode As Boolean
	Get
	Set
public:
property bool AcceleratedGraphicsMode {
	bool get ();
	void set (bool value);
}
member AcceleratedGraphicsMode : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: The Accelerated Graphics mode is either disabled or inapplicable in the associated view.
See Also
Reference
TemporaryViewModes Class
Autodesk.Revit.DB Namespace